# SpaceTypeName Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
HVACLoadSpaceType..::..SpaceTypeName Property
HVACLoadSpaceType Class See Also
---
The space type name.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2018
# Syntax
C#
---
```text
public string SpaceTypeName { get; set; }
```

Visual Basic
---
```text
Public Property SpaceTypeName As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ SpaceTypeName {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: name is an empty string or contains only whitespace. -or- When setting this property: name cannot include prohibited characters. -or- When setting this property: The given value for name is already in use as a space type name. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
HVACLoadSpaceType Class
Autodesk.Revit.DB.Analysis Namespace